erp3l/src/Enums/ТипыДоговоров/ТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоговоров</name>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>ВвозИзЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>СДавальцем</name>
  </enumValues>
  <enumValues>
    <name>СПереработчиком</name>
  </enumValues>
  <enumValues>
    <name>СПоклажедателем</name>
  </enumValues>
  <enumValues>
    <name>СХранителем</name>
  </enumValues>
  <enumValues>
    <name>СКомитентомНаЗакупку</name>
    <comment>00004303</comment>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/СостоянияДоговоровКонтрагентов/СостоянияДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДоговоровКонтрагентов</name>
  <enumValues>
    <name>ОжидаетсяСогласование</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/ДоговорыКредитовИДепозитов/ДоговорыКредитовИДепозитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКредитовИДепозитов</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКомиссии</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПроцентов</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервогоТранша</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПорядокОплаты</name>
    <type>
      <types>EnumRef.УдалитьПорядокОплатыПоСоглашениям</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокМес</name>
    <comment>Срок в месяцах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДСКомиссии</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДСОсновногоДолга</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДСПоступленияВыдачи</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДСПроцентов</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовРасходовКомиссии</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовРасходовПроцентов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКомиссии</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЛимита</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПроцентов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаТраншей</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ТипыДоговораКредитовИДепозитов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКомиссии</name>
    <type>
      <types>EnumRef.ТипыКомиссииКредитовИДепозитов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрочности</name>
    <type>
      <types>EnumRef.ТипыСрочностиКредитовИДепозитов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерДоговора</name>
    <type>
      <types>EnumRef.ХарактерыДоговоровФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчетаДенежныхСредств</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПлатежаФЗ275</name>
    <type>
      <types>CatalogRef.ТипыПлатежейФЗ275</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйНомерВалютногоКонтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>22</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодРаздел7ДекларацииНДС</name>
    <type>
      <types>CatalogRef.КодыОперацийРаздела7ДекларацииПоНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСоглашения</name>
    <comment>Версия соглашения, на основании которой заполнен элемент справочника ДоговорыКонтрагентов.</comment>
    <type>
      <types>DefinedType.ВерсияСоглашения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораУХ</name>
    <comment>Вид договора по классификатору &quot;1С:Управление Холдингом&quot;</comment>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыУчетаФИ</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаФинансовыхИнструментовМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансовогоИнструмента</name>
    <comment>(УХ)</comment>
    <type>
      <types>EnumRef.ВидыФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйДоговор</name>
    <comment>Рамочный договор (УХ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСоглашения</name>
    <comment>(УХ)</comment>
    <type>
      <types>EnumRef.ВидыСоглашений</types>
    </type>
  </attributes>
  <attributes>
    <name>Котировка</name>
    <type>
      <types>CatalogRef.ВидыКотировокФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАктуализацииЗаявок</name>
    <type>
      <types>EnumRef.РежимыАктуализацииЗаявокПоГрафикам</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетПлатежа</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Обеспечение</name>
    <attributes>
      <name>НомерДоговора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыДоговоровКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбеспечения</name>
      <type>
        <types>EnumRef.ТипыОбеспеченияКредитовИДепозитов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодтверждающиеДокументы</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ВидыПодтверждающихДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.ДоговорыКредитовИДепозитовПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/CommonModules/ВстраиваниеУХДоговорыКонтрагентов/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль используется для встраивания специфичной логики продукта 
// Управление холдингом.ERP в части управления договорами.
////////////////////////////////////////////////////////////////////////////////

#Область ДоговорыКонтрагентов

Процедура ДоговорыКонтрагентов_ФормаСписка_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	// Изменение списка объектов.
	Форма.Список.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СправочникДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	СправочникДоговорыКонтрагентов.ВерсияДанных КАК ВерсияДанных,
	|	СправочникДоговорыКонтрагентов.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникДоговорыКонтрагентов.Предопределенный КАК Предопределенный,
	|	СправочникДоговорыКонтрагентов.Наименование КАК Наименование,
	|	СправочникДоговорыКонтрагентов.Номер КАК Номер,
	|	СправочникДоговорыКонтрагентов.Дата КАК Дата,
	|	СправочникДоговорыКонтрагентов.Партнер КАК Партнер,
	|	СправочникДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	СправочникДоговорыКонтрагентов.Организация КАК Организация,
	|	СправочникДоговорыКонтрагентов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СправочникДоговорыКонтрагентов.ТипДоговора КАК ТипДоговора,
	|	СправочникДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СправочникДоговорыКонтрагентов.ОплатаВВалюте КАК ОплатаВВалюте ,
	|	СправочникДоговорыКонтрагентов.Статус КАК Статус,
	|	СправочникДоговорыКонтрагентов.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	СправочникДоговорыКонтрагентов.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	СправочникДоговорыКонтрагентов.Менеджер КАК Менеджер,
	|	СправочникДоговорыКонтрагентов.Комментарий КАК Комментарий,
	|	СправочникДоговорыКонтрагентов.БанковскийСчет КАК БанковскийСчет,
	|	СправочникДоговорыКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	СправочникДоговорыКонтрагентов.ПлатежиПо275ФЗ КАК ПлатежиПо275ФЗ,
	|	&ПартнерПоУмолчанию КАК ПартнерПоУмолчанию,
	|	ЕСТЬNULL(РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта, ЗНАЧЕНИЕ(Перечисление.СостоянияДоговоров.ПустаяСсылка)) КАК Состояние,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЛОЖЬ
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И СправочникДоговорыКонтрагентов.ДатаНачалаДействия < &ДатаАктуальности
	|					ИЛИ СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия < &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СогласованиеПросрочено,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЛОЖЬ
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия < &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СрокДействияИстек,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЛОЖЬ
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаНачалаДействия > &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СрокДействияНеНаступил,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА (СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|				ИЛИ СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует))
	|				И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СправочникДоговорыКонтрагентов.ДатаОкончанияДействия
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|				И СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СправочникДоговорыКонтрагентов.ДатаНачалаДействия
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаНачалаДействия > &ДатаАктуальности)
	|			ТОГДА СправочникДоговорыКонтрагентов.ДатаНачалаДействия
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЛОЖЬ
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И СправочникДоговорыКонтрагентов.ДатаНачалаДействия < &ДатаАктуальности
	|					ИЛИ СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия < &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия < &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаНачалаДействия > &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Просрочен,
	|	СправочникДоговорыКонтрагентов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СправочникДоговорыКонтрагентов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СправочникДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	СправочникДоговорыКонтрагентов.ВидДоговораУХ КАК ВидДоговораУХ,
	|	СправочникДоговорыКонтрагентов.БазовыйДоговор КАК БазовыйДоговор,
	|	СправочникДоговорыКонтрагентов.ВидСоглашения КАК ВидСоглашения
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК СправочникДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
	|		ПО СправочникДоговорыКонтрагентов.Ссылка = РегистрСостоянийОбъектовСрезПоследних.Объект";
		
	// Добавление реквизитов на форму.
	МассивДобавляемых = Новый Массив;
	// Реквизит ВидДоговораУХ
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ВидыДоговоровКонтрагентовУХ"));
	ОписаниеТиповРеквизита = Новый ОписаниеТипов(МассивТипов);
	НаименованиеНовогоРеквизита = "ВидДоговораУХ";
	ЗаголовокРеквизита = НСтр("ru = 'Вид договора'");
	НовыйРеквизитФормы = Новый РеквизитФормы(НаименованиеНовогоРеквизита, ОписаниеТиповРеквизита, "", ЗаголовокРеквизита);
	МассивДобавляемых.Добавить(НовыйРеквизитФормы);
	
	// Реквизит "СостояниеДоговораУХ"
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.СостоянияДоговоров"));
	ОписаниеТиповРеквизита = Новый ОписаниеТипов(МассивТипов);
	НаименованиеНовогоРеквизита = "СостояниеДоговораУХ";
	ЗаголовокРеквизита = НСтр("ru = 'Текущее состояние'");
	НовыйРеквизитФормы = Новый РеквизитФормы(НаименованиеНовогоРеквизита, ОписаниеТиповРеквизита, "", ЗаголовокРеквизита);
	МассивДобавляемых.Добавить(НовыйРеквизитФормы);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемых);
	
	ГруппаБыстрыеОтборы = Форма.Элементы.БыстрыеОтборы;

	// Убираем видимость исходного элемента отбора Состояния
	ИсходныйЭлементОтборСостояние = Форма.Элементы.ОтборСостояние;
	ИсходныйЭлементОтборСостояние.Видимость = Ложь;
	
	// Добавление элемента Вид договора.
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
	ПараметрыЭлемента.Вставить("КнопкаОчистки", Истина);
	ПараметрыЭлемента.Вставить("КнопкаОткрытия", Ложь);
	ПараметрыЭлемента.Вставить("АвтоМаксимальнаяШирина", Ложь);
	ПараметрыЭлемента.Вставить("МаксимальнаяШирина", 22);
	ПараметрыЭлемента.Вставить("ПодсказкаВвода", НСтр("ru = 'Все'"));
	НовыйЭлемент = ФормыУХ.СоздатьПолеФормы(
		Форма.Элементы, "ВидДоговораУХ", НСтр("ru = 'Вид договора'"), "ВидДоговораУХ", ВидПоляФормы.ПолеВвода, ГруппаБыстрыеОтборы, 
		ИсходныйЭлементОтборСостояние, ПараметрыЭлемента);
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ЭлементПриИзмененииУХ");
	
	// Добавление элемента СостояниеДоговораУХ.
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
	ПараметрыЭлемента.Вставить("КнопкаОчистки", Истина);
	ПараметрыЭлемента.Вставить("КнопкаОткрытия", Ложь);
	ПараметрыЭлемента.Вставить("АвтоМаксимальнаяШирина", Ложь);
	ПараметрыЭлемента.Вставить("МаксимальнаяШирина", 22);
	ПараметрыЭлемента.Вставить("ПодсказкаВвода", НСтр("ru = 'Все'"));
	НовыйЭлемент = ФормыУХ.СоздатьПолеФормы(
		Форма.Элементы, "СостояниеДоговораУХ", НСтр("ru = 'Текущее состояние'"), "СостояниеДоговораУХ", 
		ВидПоляФормы.ПолеВвода, ГруппаБыстрыеОтборы, ИсходныйЭлементОтборСостояние, ПараметрыЭлемента);
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ЭлементПриИзмененииУХ");
	
	// Добавление колонки Вид договора в таблицу.
	НовыйЭлемент = Форма.Элементы.Добавить("СписокВидДоговораУХ", Тип("ПолеФормы"), Форма.Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ВидДоговораУХ";
	
	// Скрытие колонки Тип договора.
	Форма.Элементы.СписокТипДоговора.Видимость = Ложь;
	
КонецПроцедуры		// ДоговорыКонтрагентов_ПриСозданииНаСервере()

Процедура ДоговорыКонтрагентов_ФормаВыбора_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	// Изменение списка объектов.
	Форма.Список.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СправочникДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	СправочникДоговорыКонтрагентов.ВерсияДанных КАК ВерсияДанных,
	|	СправочникДоговорыКонтрагентов.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникДоговорыКонтрагентов.Предопределенный КАК Предопределенный,
	|	СправочникДоговорыКонтрагентов.Наименование КАК Наименование,
	|	СправочникДоговорыКонтрагентов.Номер КАК Номер,
	|	СправочникДоговорыКонтрагентов.Дата КАК Дата,
	|	СправочникДоговорыКонтрагентов.НаименованиеДляПечати КАК НаименованиеДляПечати,
	|	СправочникДоговорыКонтрагентов.Партнер КАК Партнер,
	|	СправочникДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	СправочникДоговорыКонтрагентов.Организация КАК Организация,
	|	СправочникДоговорыКонтрагентов.ПорядокРасчетов КАК ПорядокРасчетов,
	|	СправочникДоговорыКонтрагентов.ТипДоговора КАК ТипДоговора,
	|	СправочникДоговорыКонтрагентов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СправочникДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СправочникДоговорыКонтрагентов.ОплатаВВалюте  КАК ОплатаВВалюте ,
	|	СправочникДоговорыКонтрагентов.БанковскийСчет КАК БанковскийСчет,
	|	СправочникДоговорыКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	СправочникДоговорыКонтрагентов.Статус КАК Статус,
	|	СправочникДоговорыКонтрагентов.Согласован КАК Согласован,
	|	СправочникДоговорыКонтрагентов.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	СправочникДоговорыКонтрагентов.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	СправочникДоговорыКонтрагентов.Менеджер КАК Менеджер,
	|	СправочникДоговорыКонтрагентов.Комментарий КАК Комментарий,
	|	СправочникДоговорыКонтрагентов.УчетАгентскогоНДС КАК УчетАгентскогоНДС,
	|	СправочникДоговорыКонтрагентов.ДополнительныеРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Свойство КАК Свойство,
	|		Значение КАК Значение,
	|		ТекстоваяСтрока КАК ТекстоваяСтрока
	|	) КАК ДополнительныеРеквизиты,
	|	&ПартнерПоУмолчанию КАК ПартнерПоУмолчанию,
	|	СправочникДоговорыКонтрагентов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СправочникДоговорыКонтрагентов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СправочникДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	СправочникДоговорыКонтрагентов.ДоговорСУчастникомГОЗ КАК ДоговорСУчастникомГОЗ,
	|	СправочникДоговорыКонтрагентов.ПлатежиПо275ФЗ КАК ПлатежиПо275ФЗ,
	|	СправочникДоговорыКонтрагентов.ГосударственныйКонтракт КАК ГосударственныйКонтракт,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|				И СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПодходитДляПодбораВДоговорЗаказчика,
		//++ УХ_Встраивание
	|	СправочникДоговорыКонтрагентов.ВидДоговораУХ КАК ВидДоговораУХ,
	|	СправочникДоговорыКонтрагентов.БазовыйДоговор КАК БазовыйДоговор,
	|	СправочникДоговорыКонтрагентов.ВидСоглашения КАК ВидСоглашения
	//--
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК СправочникДоговорыКонтрагентов
	|	{ГДЕ
	|	СправочникДоговорыКонтрагентов.Организация В (&Организация)
	|	ИЛИ СправочникДоговорыКонтрагентов.Организация.ГоловнаяОрганизация В (&Организация)
	|	ИЛИ СправочникДоговорыКонтрагентов.Филиалы.Организация В (&Организация) КАК ОтборПоОрганизации,
	|   &Организация КАК ОрганизацияОтбора,
	| 	ВЫБОР КОГДА СправочникДоговорыКонтрагентов.РазрешенаРаботаСДочернимиПартнерами
	|		ТОГДА СправочникДоговорыКонтрагентов.Партнер В (&СписокПартнеров)
	| 	ИНАЧЕ СправочникДоговорыКонтрагентов.Партнер В (&ПартнерПоУмолчанию)
	| 	КОНЕЦ КАК ОтборПоПартнеру
	| 	}";
	
	
	// Добавление колонки Вид договора в таблицу.
	ЭлементСписок = Форма.Элементы.Список;
	НовыйЭлемент = Форма.Элементы.Добавить("ВидДоговораУХ", Тип("ПолеФормы"), Форма.Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ВидДоговораУХ";
	// Скрытие колонки Тип договора.
	Форма.Элементы.СписокТипДоговора.Видимость = Ложь;
КонецПроцедуры

Процедура ДоговорыКонтрагентов_ФормаСпискаПродажи_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	// Изменение списка объектов.
	Форма.Список.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СправочникДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	СправочникДоговорыКонтрагентов.ВерсияДанных КАК ВерсияДанных,
	|	СправочникДоговорыКонтрагентов.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникДоговорыКонтрагентов.Предопределенный КАК Предопределенный,
	|	СправочникДоговорыКонтрагентов.Наименование КАК Наименование,
	|	СправочникДоговорыКонтрагентов.Номер КАК Номер,
	|	СправочникДоговорыКонтрагентов.Дата КАК Дата,
	|	СправочникДоговорыКонтрагентов.Партнер КАК Партнер,
	|	СправочникДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	СправочникДоговорыКонтрагентов.Организация КАК Организация,
	|	СправочникДоговорыКонтрагентов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СправочникДоговорыКонтрагентов.ТипДоговора КАК ТипДоговора,
	|	СправочникДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СправочникДоговорыКонтрагентов.ОплатаВВалюте  КАК ОплатаВВалюте ,
	|	СправочникДоговорыКонтрагентов.Статус КАК Статус,
	|	СправочникДоговорыКонтрагентов.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	СправочникДоговорыКонтрагентов.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	СправочникДоговорыКонтрагентов.Менеджер КАК Менеджер,
	|	СправочникДоговорыКонтрагентов.Комментарий КАК Комментарий,
	|	СправочникДоговорыКонтрагентов.БанковскийСчет КАК БанковскийСчет,
	|	СправочникДоговорыКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	СправочникДоговорыКонтрагентов.ПлатежиПо275ФЗ КАК ПлатежиПо275ФЗ,
	|	&ПартнерПоУмолчанию КАК ПартнерПоУмолчанию,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту) КАК ХозяйственнаяОперацияПоУмолчанию,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияДоговоровКонтрагентов.ПустаяСсылка)
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Закрыт)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияДоговоровКонтрагентов.Закрыт)
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияДоговоровКонтрагентов.Действует)
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияДоговоровКонтрагентов.ОжидаетсяСогласование)
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЛОЖЬ
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И СправочникДоговорыКонтрагентов.ДатаНачалаДействия < &ДатаАктуальности
	|					ИЛИ СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия < &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СогласованиеПросрочено,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЛОЖЬ
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия < &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СрокДействияИстек,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЛОЖЬ
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаНачалаДействия > &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СрокДействияНеНаступил,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА (СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|				ИЛИ СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует))
	|				И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СправочникДоговорыКонтрагентов.ДатаОкончанияДействия
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|				И СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СправочникДоговорыКонтрагентов.ДатаНачалаДействия
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаНачалаДействия > &ДатаАктуальности)
	|			ТОГДА СправочникДоговорыКонтрагентов.ДатаНачалаДействия
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЛОЖЬ
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И СправочникДоговорыКонтрагентов.ДатаНачалаДействия < &ДатаАктуальности
	|					ИЛИ СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия < &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия < &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаНачалаДействия > &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Просрочен,
	|	СправочникДоговорыКонтрагентов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СправочникДоговорыКонтрагентов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СправочникДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	СправочникДоговорыКонтрагентов.ВидДоговораУХ КАК ВидДоговораУХ,
	|	СправочникДоговорыКонтрагентов.БазовыйДоговор КАК БазовыйДоговор,
	|	СправочникДоговорыКонтрагентов.ВидСоглашения КАК ВидСоглашения
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК СправочникДоговорыКонтрагентов
	|ГДЕ
	|	(СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|			ИЛИ СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
	|			ИЛИ СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))";
	// Добавление реквизита Вид договора на форму.
	МассивДобавляемых = Новый Массив;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ВидыДоговоровКонтрагентовУХ"));
	ОписаниеТиповРеквизита = Новый ОписаниеТипов(МассивТипов);
	НаименованиеНовогоРеквизита = "ВидДоговораУХ";
	ЗаголовокРеквизита = НСтр("ru = 'Вид договора'");
	НовыйРеквизитФормы = Новый РеквизитФормы(НаименованиеНовогоРеквизита, ОписаниеТиповРеквизита, "", ЗаголовокРеквизита);
	МассивДобавляемых.Добавить(НовыйРеквизитФормы);
	Форма.ИзменитьРеквизиты(МассивДобавляемых);
	// Добавление элемента Вид договора.
	ГруппаБыстрыеОтборы = Форма.Элементы.БыстрыеОтборы;
	ЭлементОтборСостояние = Форма.Элементы.ОтборСостояние;
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
	ПараметрыЭлемента.Вставить("КнопкаОчистки", Истина);
	ПараметрыЭлемента.Вставить("КнопкаОткрытия", Ложь);
	ПараметрыЭлемента.Вставить("АвтоМаксимальнаяШирина", Ложь);
	ПараметрыЭлемента.Вставить("МаксимальнаяШирина", 22);
	ПараметрыЭлемента.Вставить("ПодсказкаВвода", НСтр("ru = 'Все'"));
	НовыйЭлемент = ФормыУХ.СоздатьПолеФормы(
		Форма.Элементы, "ВидДоговораУХ", НСтр("ru = 'Вид договора'"), "ВидДоговораУХ", ВидПоляФормы.ПолеВвода, ГруппаБыстрыеОтборы, ЭлементОтборСостояние, ПараметрыЭлемента);
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОтборВидДоговораПриИзмененииУХ");
	// Добавление колонки Вид договора в таблицу.
	ЭлементСписок = Форма.Элементы.Список;
	НовыйЭлемент = Форма.Элементы.Добавить("СписокВидДоговораУХ", Тип("ПолеФормы"), Форма.Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ВидДоговораУХ";
	// Скрытие колонки Тип договора.
	Форма.Элементы.СписокТипДоговора.Видимость = Ложь;
КонецПроцедуры		// ДоговорыКонтрагентов_ФормаСпискаПродажи_ПриСозданииНаСервере()

Процедура ДоговорыКонтрагентов_ФормаСпискаЗакупки_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	// Изменение списка объектов.
	Форма.Список.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СправочникДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	СправочникДоговорыКонтрагентов.ВерсияДанных КАК ВерсияДанных,
	|	СправочникДоговорыКонтрагентов.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникДоговорыКонтрагентов.Предопределенный КАК Предопределенный,
	|	СправочникДоговорыКонтрагентов.Наименование КАК Наименование,
	|	СправочникДоговорыКонтрагентов.Номер КАК Номер,
	|	СправочникДоговорыКонтрагентов.Дата КАК Дата,
	|	СправочникДоговорыКонтрагентов.Партнер КАК Партнер,
	|	СправочникДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	СправочникДоговорыКонтрагентов.Организация КАК Организация,
	|	СправочникДоговорыКонтрагентов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СправочникДоговорыКонтрагентов.ТипДоговора КАК ТипДоговора,
	|	СправочникДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СправочникДоговорыКонтрагентов.ОплатаВВалюте  КАК ОплатаВВалюте ,
	|	СправочникДоговорыКонтрагентов.Статус КАК Статус,
	|	СправочникДоговорыКонтрагентов.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	СправочникДоговорыКонтрагентов.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	СправочникДоговорыКонтрагентов.Менеджер КАК Менеджер,
	|	СправочникДоговорыКонтрагентов.Комментарий КАК Комментарий,
	|	СправочникДоговорыКонтрагентов.БанковскийСчет КАК БанковскийСчет,
	|	СправочникДоговорыКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	СправочникДоговорыКонтрагентов.ПлатежиПо275ФЗ КАК ПлатежиПо275ФЗ,
	|	&ПартнерПоУмолчанию КАК ПартнерПоУмолчанию,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика) КАК ХозяйственнаяОперацияПоУмолчанию,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияДоговоровКонтрагентов.ПустаяСсылка)
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Закрыт)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияДоговоровКонтрагентов.Закрыт)
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияДоговоровКонтрагентов.Действует)
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияДоговоровКонтрагентов.ОжидаетсяСогласование)
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЛОЖЬ
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И СправочникДоговорыКонтрагентов.ДатаНачалаДействия < &ДатаАктуальности
	|					ИЛИ СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия < &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СогласованиеПросрочено,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЛОЖЬ
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия < &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СрокДействияИстек,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЛОЖЬ
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаНачалаДействия > &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СрокДействияНеНаступил,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА (СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|				ИЛИ СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует))
	|				И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СправочникДоговорыКонтрагентов.ДатаОкончанияДействия
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|				И СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СправочникДоговорыКонтрагентов.ДатаНачалаДействия
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаНачалаДействия > &ДатаАктуальности)
	|			ТОГДА СправочникДоговорыКонтрагентов.ДатаНачалаДействия
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА СправочникДоговорыКонтрагентов.ПометкаУдаления
	|			ТОГДА ЛОЖЬ
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И СправочникДоговорыКонтрагентов.ДатаНачалаДействия < &ДатаАктуальности
	|					ИЛИ СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия < &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаОкончанияДействия < &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		КОГДА СправочникДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|				И (СправочникДоговорыКонтрагентов.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СправочникДоговорыКонтрагентов.ДатаНачалаДействия > &ДатаАктуальности)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Просрочен,
	|	СправочникДоговорыКонтрагентов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СправочникДоговорыКонтрагентов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СправочникДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	СправочникДоговорыКонтрагентов.ВидДоговораУХ КАК ВидДоговораУХ,
	|	СправочникДоговорыКонтрагентов.ВидСоглашения КАК ВидСоглашения,
	|	СправочникДоговорыКонтрагентов.БазовыйДоговор КАК БазовыйДоговор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК СправочникДоговорыКонтрагентов
	|ГДЕ
	|	(СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|			ИЛИ СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути)
	|			ИЛИ СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки)
	|			ИЛИ СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС)
	|			ИЛИ СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути)
	|			ИЛИ СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки)
	|			ИЛИ СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемНаКомиссию)
	|			ИЛИ СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоУПереработчика)
	|			ИЛИ СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпорту)
	|			ИЛИ СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути)
	|			ИЛИ СправочникДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи))";
	// Добавление реквизита Вид договора на форму.
	МассивДобавляемых = Новый Массив;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ВидыДоговоровКонтрагентовУХ"));
	ОписаниеТиповРеквизита = Новый ОписаниеТипов(МассивТипов);
	НаименованиеНовогоРеквизита = "ВидДоговораУХ";
	ЗаголовокРеквизита = НСтр("ru = 'Вид договора'");
	НовыйРеквизитФормы = Новый РеквизитФормы(НаименованиеНовогоРеквизита, ОписаниеТиповРеквизита, "", ЗаголовокРеквизита);
	МассивДобавляемых.Добавить(НовыйРеквизитФормы);
	Форма.ИзменитьРеквизиты(МассивДобавляемых);
	// Добавление элемента Вид договора.
	ГруппаБыстрыеОтборы = Форма.Элементы.БыстрыеОтборы;
	ЭлементОтборСостояние = Форма.Элементы.ОтборСостояние;
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
	ПараметрыЭлемента.Вставить("КнопкаОчистки", Истина);
	ПараметрыЭлемента.Вставить("КнопкаОткрытия", Ложь);
	ПараметрыЭлемента.Вставить("АвтоМаксимальнаяШирина", Ложь);
	ПараметрыЭлемента.Вставить("МаксимальнаяШирина", 22);
	ПараметрыЭлемента.Вставить("ПодсказкаВвода", НСтр("ru = 'Все'"));
	НовыйЭлемент = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ВидДоговораУХ", НСтр("ru = 'Вид договора'"), "ВидДоговораУХ", ВидПоляФормы.ПолеВвода, ГруппаБыстрыеОтборы, ЭлементОтборСостояние, ПараметрыЭлемента);
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОтборВидДоговораПриИзмененииУХ");
	// Добавление колонки Вид договора в таблицу.
	ЭлементСписок = Форма.Элементы.Список;
	НовыйЭлемент = Форма.Элементы.Добавить("СписокВидДоговораУХ", Тип("ПолеФормы"), Форма.Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ВидДоговораУХ";
	// Скрытие колонки Тип договора.
	Форма.Элементы.СписокТипДоговора.Видимость = Ложь;
КонецПроцедуры		// ДоговорыКонтрагентов_ФормаСпискаЗакупки_ПриСозданииНаСервере()

#КонецОбласти

#Область ДоговорыКредитовИДепозитов

Процедура ДоговорыКредитовИДепозитов_ФормаСписка_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	Форма.Список.ПроизвольныйЗапрос = Истина;
	Форма.Список.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СправочникДоговорыКредитовИДепозитов.Ссылка КАК Ссылка,
	|	СправочникДоговорыКредитовИДепозитов.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникДоговорыКредитовИДепозитов.Наименование КАК Наименование,
	|	СправочникДоговорыКредитовИДепозитов.БанковскийСчет КАК БанковскийСчет,
	|	СправочникДоговорыКредитовИДепозитов.БанковскийСчетКомиссии КАК БанковскийСчетКомиссии,
	|	СправочникДоговорыКредитовИДепозитов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	СправочникДоговорыКредитовИДепозитов.БанковскийСчетПроцентов КАК БанковскийСчетПроцентов,
	|	СправочникДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СправочникДоговорыКредитовИДепозитов.Дата КАК Дата,
	|	СправочникДоговорыКредитовИДепозитов.ДатаПервогоТранша КАК ДатаПервогоТранша,
	|	СправочникДоговорыКредитовИДепозитов.ДатаПоследнегоПлатежа КАК ДатаПоследнегоПлатежа,
	|	СправочникДоговорыКредитовИДепозитов.Касса КАК Касса,
	|	СправочникДоговорыКредитовИДепозитов.Комментарий КАК Комментарий,
	|	СправочникДоговорыКредитовИДепозитов.Контрагент КАК Контрагент,
	|	СправочникДоговорыКредитовИДепозитов.НаименованиеДляПечати КАК НаименованиеДляПечати,
	|	СправочникДоговорыКредитовИДепозитов.Номер КАК Номер,
	|	СправочникДоговорыКредитовИДепозитов.Организация КАК Организация,
	|	СправочникДоговорыКредитовИДепозитов.Ответственный КАК Ответственный,
	|	СправочникДоговорыКредитовИДепозитов.Партнер КАК Партнер,
	|	СправочникДоговорыКредитовИДепозитов.Подразделение КАК Подразделение,
	|	СправочникДоговорыКредитовИДепозитов.ОплатаВВалюте  КАК ОплатаВВалюте ,
	|	СправочникДоговорыКредитовИДепозитов.Согласован КАК Согласован,
	|	СправочникДоговорыКредитовИДепозитов.СрокДней КАК СрокДней,
	|	СправочникДоговорыКредитовИДепозитов.СрокМес КАК СрокМес,
	|	СправочникДоговорыКредитовИДепозитов.Статус КАК Статус,
	|	СправочникДоговорыКредитовИДепозитов.СтатьяДДСКомиссии КАК СтатьяДДСКомиссии,
	|	СправочникДоговорыКредитовИДепозитов.СтатьяДДСОсновногоДолга КАК СтатьяДДСОсновногоДолга,
	|	СправочникДоговорыКредитовИДепозитов.СтатьяДДСПоступленияВыдачи КАК СтатьяДДСПоступленияВыдачи,
	|	СправочникДоговорыКредитовИДепозитов.СтатьяДДСПроцентов КАК СтатьяДДСПроцентов,
	|	СправочникДоговорыКредитовИДепозитов.СтатьяДоходовРасходовКомиссии КАК СтатьяДоходовРасходовКомиссии,
	|	СправочникДоговорыКредитовИДепозитов.СтатьяДоходовРасходовПроцентов КАК СтатьяДоходовРасходовПроцентов,
	|	СправочникДоговорыКредитовИДепозитов.СуммаКомиссии КАК СуммаКомиссии,
	|	СправочникДоговорыКредитовИДепозитов.СуммаЛимита КАК СуммаЛимита,
	|	СправочникДоговорыКредитовИДепозитов.СуммаПроцентов КАК СуммаПроцентов,
	|	СправочникДоговорыКредитовИДепозитов.СуммаТраншей КАК СуммаТраншей,
	|	СправочникДоговорыКредитовИДепозитов.ТипДоговора КАК ТипДоговора,
	|	СправочникДоговорыКредитовИДепозитов.ТипКомиссии КАК ТипКомиссии,
	|	СправочникДоговорыКредитовИДепозитов.ТипСрочности КАК ТипСрочности,
	|	СправочникДоговорыКредитовИДепозитов.ФормаОплаты КАК ФормаОплаты,
	|	СправочникДоговорыКредитовИДепозитов.ХарактерДоговора КАК ХарактерДоговора,
	|	СправочникДоговорыКредитовИДепозитов.ГруппаФинансовогоУчетаДенежныхСредств КАК ГруппаФинансовогоУчетаДенежныхСредств,
	|	СправочникДоговорыКредитовИДепозитов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СправочникДоговорыКредитовИДепозитов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СправочникДоговорыКредитовИДепозитов.ТипПлатежаФЗ275 КАК ТипПлатежаФЗ275,
	|	СправочникДоговорыКредитовИДепозитов.УникальныйНомерВалютногоКонтроля КАК УникальныйНомерВалютногоКонтроля,
	|	СправочникДоговорыКредитовИДепозитов.КодРаздел7ДекларацииНДС КАК КодРаздел7ДекларацииНДС,
	|	СправочникДоговорыКредитовИДепозитов.ВерсияСоглашения КАК ВерсияСоглашения,
	|	СправочникДоговорыКредитовИДепозитов.ВидДоговораУХ КАК ВидДоговораУХ,
	|	СправочникДоговорыКредитовИДепозитов.ПараметрыУчетаФИ КАК ПараметрыУчетаФИ,
	|	СправочникДоговорыКредитовИДепозитов.ВидФинансовогоИнструмента КАК ВидФинансовогоИнструмента,
	|	СправочникДоговорыКредитовИДепозитов.Обеспечение.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		НомерДоговора КАК НомерДоговора,
	|		Контрагент КАК Контрагент,
	|		Статус КАК Статус,
	|		Комментарий КАК Комментарий,
	|		ДатаНачала КАК ДатаНачала,
	|		ДатаОкончания КАК ДатаОкончания,
	|		ТипОбеспечения КАК ТипОбеспечения
	|	) КАК Обеспечение,
	|	СправочникДоговорыКредитовИДепозитов.ДополнительныеРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Свойство КАК Свойство,
	|		Значение КАК Значение,
	|		ТекстоваяСтрока КАК ТекстоваяСтрока
	|	) КАК ДополнительныеРеквизиты,
	|	СправочникДоговорыКредитовИДепозитов.ПодтверждающиеДокументы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ВидДокумента КАК ВидДокумента,
	|		Номер КАК Номер,
	|		Дата КАК Дата,
	|		Сумма КАК Сумма,
	|		Файл КАК Файл
	|	) КАК ПодтверждающиеДокументы,
	|	СправочникДоговорыКредитовИДепозитов.Предопределенный КАК Предопределенный,
	|	СправочникДоговорыКредитовИДепозитов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	СправочникДоговорыКредитовИДепозитов.БазовыйДоговор КАК БазовыйДоговор,
	|	СправочникДоговорыКредитовИДепозитов.ВидСоглашения КАК ВидСоглашения
	|ИЗ
	|	Справочник.ДоговорыКредитовИДепозитов КАК СправочникДоговорыКредитовИДепозитов";
	// Добавление реквизита Вид договора на форму.
	МассивДобавляемых = Новый Массив;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ВидыДоговоровКонтрагентовУХ"));
	ОписаниеТиповРеквизита = Новый ОписаниеТипов(МассивТипов);
	НаименованиеНовогоРеквизита = "ВидДоговораУХ";
	ЗаголовокРеквизита = НСтр("ru = 'Вид договора'");
	НовыйРеквизитФормы = Новый РеквизитФормы(НаименованиеНовогоРеквизита, ОписаниеТиповРеквизита, "", ЗаголовокРеквизита);
	МассивДобавляемых.Добавить(НовыйРеквизитФормы);
	Форма.ИзменитьРеквизиты(МассивДобавляемых);
	// Добавление элемента Вид договора.
	ГруппаБыстрыеОтборы = Форма.Элементы.ГруппаОтбор;
	ЭлементОтборСостояние = Форма.Элементы.СтатусОтбор;
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
	ПараметрыЭлемента.Вставить("КнопкаОчистки", Истина);
	ПараметрыЭлемента.Вставить("КнопкаОткрытия", Ложь);
	ПараметрыЭлемента.Вставить("АвтоМаксимальнаяШирина", Ложь);
	ПараметрыЭлемента.Вставить("МаксимальнаяШирина", 22);
	ПараметрыЭлемента.Вставить("ПодсказкаВвода", НСтр("ru = 'Все'"));
	НовыйЭлемент = ФормыУХ.СоздатьПолеФормы(
		Форма.Элементы, "ВидДоговораУХ", НСтр("ru = 'Вид договора'"), "ВидДоговораУХ", ВидПоляФормы.ПолеВвода, ГруппаБыстрыеОтборы, ЭлементОтборСостояние, ПараметрыЭлемента);
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "БыстрыйОтборПриИзменении");
	// Добавление колонки Вид договора в таблицу.
	ЭлементСписок = Форма.Элементы.Список;
	НовыйЭлемент = Форма.Элементы.Добавить("СписокВидДоговораУХ", Тип("ПолеФормы"), Форма.Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ВидДоговораУХ";
	// Скрытие колонки Тип договора.
	Форма.Элементы.ТипДоговора.Видимость = Ложь;
КонецПроцедуры

Процедура ДоговорыКредитовИДепозитов_ФормаВыбора_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	// Изменение списка объектов.
	Форма.Список.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СправочникДоговорыКредитовИДепозитов.Ссылка КАК Ссылка,
	|	СправочникДоговорыКредитовИДепозитов.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникДоговорыКредитовИДепозитов.Наименование КАК Наименование,
	|	СправочникДоговорыКредитовИДепозитов.БанковскийСчет КАК БанковскийСчет,
	|	СправочникДоговорыКредитовИДепозитов.БанковскийСчетКомиссии КАК БанковскийСчетКомиссии,
	|	СправочникДоговорыКредитовИДепозитов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	СправочникДоговорыКредитовИДепозитов.БанковскийСчетПроцентов КАК БанковскийСчетПроцентов,
	|	СправочникДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СправочникДоговорыКредитовИДепозитов.Дата КАК Дата,
	|	СправочникДоговорыКредитовИДепозитов.ДатаПервогоТранша КАК ДатаПервогоТранша,
	|	СправочникДоговорыКредитовИДепозитов.ДатаПоследнегоПлатежа КАК ДатаПоследнегоПлатежа,
	|	СправочникДоговорыКредитовИДепозитов.Касса КАК Касса,
	|	СправочникДоговорыКредитовИДепозитов.Комментарий КАК Комментарий,
	|	СправочникДоговорыКредитовИДепозитов.Контрагент КАК Контрагент,
	|	СправочникДоговорыКредитовИДепозитов.НаименованиеДляПечати КАК НаименованиеДляПечати,
	|	СправочникДоговорыКредитовИДепозитов.Номер КАК Номер,
	|	СправочникДоговорыКредитовИДепозитов.Организация КАК Организация,
	|	СправочникДоговорыКредитовИДепозитов.Ответственный КАК Ответственный,
	|	СправочникДоговорыКредитовИДепозитов.Партнер КАК Партнер,
	|	СправочникДоговорыКредитовИДепозитов.Подразделение КАК Подразделение,
	|	СправочникДоговорыКредитовИДепозитов.ОплатаВВалюте  КАК ОплатаВВалюте ,
	|	СправочникДоговорыКредитовИДепозитов.Согласован КАК Согласован,
	|	СправочникДоговорыКредитовИДепозитов.СрокДней КАК СрокДней,
	|	СправочникДоговорыКредитовИДепозитов.СрокМес КАК СрокМес,
	|	СправочникДоговорыКредитовИДепозитов.Статус КАК Статус,
	|	СправочникДоговорыКредитовИДепозитов.СтатьяДДСКомиссии КАК СтатьяДДСКомиссии,
	|	СправочникДоговорыКредитовИДепозитов.СтатьяДДСОсновногоДолга КАК СтатьяДДСОсновногоДолга,
	|	СправочникДоговорыКредитовИДепозитов.СтатьяДДСПоступленияВыдачи КАК СтатьяДДСПоступленияВыдачи,
	|	СправочникДоговорыКредитовИДепозитов.СтатьяДДСПроцентов КАК СтатьяДДСПроцентов,
	|	СправочникДоговорыКредитовИДепозитов.СтатьяДоходовРасходовКомиссии КАК СтатьяДоходовРасходовКомиссии,
	|	СправочникДоговорыКредитовИДепозитов.СтатьяДоходовРасходовПроцентов КАК СтатьяДоходовРасходовПроцентов,
	|	СправочникДоговорыКредитовИДепозитов.СуммаКомиссии КАК СуммаКомиссии,
	|	СправочникДоговорыКредитовИДепозитов.СуммаЛимита КАК СуммаЛимита,
	|	СправочникДоговорыКредитовИДепозитов.СуммаПроцентов КАК СуммаПроцентов,
	|	СправочникДоговорыКредитовИДепозитов.СуммаТраншей КАК СуммаТраншей,
	|	СправочникДоговорыКредитовИДепозитов.ТипДоговора КАК ТипДоговора,
	|	СправочникДоговорыКредитовИДепозитов.ТипКомиссии КАК ТипКомиссии,
	|	СправочникДоговорыКредитовИДепозитов.ТипСрочности КАК ТипСрочности,
	|	СправочникДоговорыКредитовИДепозитов.ФормаОплаты КАК ФормаОплаты,
	|	СправочникДоговорыКредитовИДепозитов.ХарактерДоговора КАК ХарактерДоговора,
	|	СправочникДоговорыКредитовИДепозитов.ГруппаФинансовогоУчетаДенежныхСредств КАК ГруппаФинансовогоУчетаДенежныхСредств,
	|	СправочникДоговорыКредитовИДепозитов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СправочникДоговорыКредитовИДепозитов.Обеспечение.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		НомерДоговора КАК НомерДоговора,
	|		Контрагент КАК Контрагент,
	|		Статус КАК Статус,
	|		Комментарий КАК Комментарий,
	|		ДатаНачала КАК ДатаНачала,
	|		ДатаОкончания КАК ДатаОкончания,
	|		ТипОбеспечения КАК ТипОбеспечения
	|	) КАК Обеспечение,
	|	СправочникДоговорыКредитовИДепозитов.ДополнительныеРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Свойство КАК Свойство,
	|		Значение КАК Значение,
	|		ТекстоваяСтрока КАК ТекстоваяСтрока
	|	) КАК ДополнительныеРеквизиты,
	|	СправочникДоговорыКредитовИДепозитов.Предопределенный КАК Предопределенный,
	|	СправочникДоговорыКредитовИДепозитов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	&ПартнерПоУмолчанию КАК ПартнерПоУмолчанию,
	|	СправочникДоговорыКредитовИДепозитов.ВидДоговораУХ КАК ВидДоговораУХ,
	|	СправочникДоговорыКредитовИДепозитов.БазовыйДоговор КАК БазовыйДоговор,
	|	СправочникДоговорыКредитовИДепозитов.ВидСоглашения КАК ВидСоглашения
	|ИЗ
	|	Справочник.ДоговорыКредитовИДепозитов КАК СправочникДоговорыКредитовИДепозитов";	
	// Добавление колонки Вид договора в таблицу.
	ЭлементСписок = Форма.Элементы.Список;
	НовыйЭлемент = Форма.Элементы.Добавить("СписокВидДоговораУХ", Тип("ПолеФормы"), Форма.Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ВидДоговораУХ";
КонецПроцедуры

#КонецОбласти
